## Exercise:

Write pandas to report the name and balance of users with a balance higher than 10000. The balance of an account is equal to the sum of the amounts of all transactions involving that account.

Return the result table in any order.

The query result format is in the following example.

In [1]:
import pandas as pd

# Creating the Users DataFrame
users_data = {'account': [900001, 900002, 900003],
              'name': ['Alice', 'Bob', 'Charlie']}
users_df = pd.DataFrame(users_data)

print("Users table:")
print(users_df)

# Creating the Transactions DataFrame
transactions_data = {'trans_id': [1, 2, 3, 4, 5, 6, 7],
                     'account': [900001, 900001, 900001, 900002, 900003, 900003, 900003],
                     'amount': [7000, 7000, -3000, 1000, 6000, 6000, -4000],
                     'transacted_on': ['2020-08-01', '2020-09-01', '2020-09-02', '2020-09-12', '2020-08-07', '2020-09-07', '2020-09-11']}
transactions_df = pd.DataFrame(transactions_data)

Users table:
   account     name
0   900001    Alice
1   900002      Bob
2   900003  Charlie

In [2]:
transactions_df.describe()

       trans_id   account       amount
count  7.000000       7.0     7.000000
mean   4.000000  900002.0  2857.142857
std    2.160247       1.0  4810.702354
min    1.000000  900001.0 -4000.000000
25%    2.500000  900001.0 -1000.000000
50%    4.000000  900002.0  6000.000000
75%    5.500000  900003.0  6500.000000
max    7.000000  900003.0  7000.000000

In [3]:
transactions_df.dtypes

trans_id          int64
account           int64
amount            int64
transacted_on    object
dtype: object

In [4]:
transactions_df.columns

Index(['trans_id', 'account', 'amount', 'transacted_on'], dtype='object')

In [10]:
balance_df = transactions_df.merge(users_df, on='account').groupby(['name']).agg(balance=('amount', 'sum')).reset_index()

In [12]:
cond = balance_df['balance'] > 10000
balance_df[cond]

    name  balance
0  Alice    11000